In [1]:
import numpy as np
import pandas as pd

In [2]:
myData = {'me':[3,5,np.nan],'mf':[4,np.nan,np.nan],'mof':[3,5,4]}

In [3]:
myData

{'me': [3, 5, nan], 'mf': [4, nan, nan], 'mof': [3, 5, 4]}

In [4]:
myDataFrame = pd.DataFrame(myData)

In [5]:
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [6]:
myDataFrame.dropna()

    me   mf  mof
0  3.0  4.0    3

In [7]:
myDataFrame.fillna(value=myDataFrame['me'].mean())

    me   mf  mof
0  3.0  4.0    3
1  5.0  4.0    5
2  4.0  4.0    4

In [9]:
newData = {'Movies':['star-wars','star-wars','batman','batman','deadpool','deadpool'],'Viewers':['me','mf','mof','bobby','dean','sammy'],'Ratings':[10,7,6,9,8,5]}

In [10]:
newData

{'Movies': ['star-wars',
  'star-wars',
  'batman',
  'batman',
  'deadpool',
  'deadpool'],
 'Viewers': ['me', 'mf', 'mof', 'bobby', 'dean', 'sammy'],
 'Ratings': [10, 7, 6, 9, 8, 5]}

In [11]:
movieFrame = pd.DataFrame(newData)

In [12]:
movieFrame

      Movies Viewers  Ratings
0  star-wars      me       10
1  star-wars      mf        7
2     batman     mof        6
3     batman   bobby        9
4   deadpool    dean        8
5   deadpool   sammy        5

In [15]:
movieFrame.groupby('Movies').mean()

           Ratings
Movies
batman         7.5
deadpool       6.5
star-wars      8.5

In [18]:
movieFrame.groupby('Movies').std()

           Ratings
Movies
batman     2.12132
deadpool   2.12132
star-wars  2.12132

In [26]:
movieFrame.groupby('Movies').std().iloc[1]

Ratings    2.12132
Name: deadpool, dtype: float64